Revit 2024 API
Document.GetProjectId Method
 Gets ForgeDM project id where the model locates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public string GetProjectId()
Visual Basic
Public Function GetProjectId As String
Visual C++
public:
String^ GetProjectId()
Remarks
 It is empty for non-cloud model; It is cached in Revit model opened session after getting it;
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.RevitServerUnauthorizedException |  Thrown when cannot get data from ForgeDM for Revit cloud model.
See Also
Document Class
Autodesk.Revit.DB Namespace